import React from 'react';
import { useNavigate } from 'react-router-dom';
import './Home.css';
import Crau from './Crau';


const Home = () => {
  const navigate = useNavigate(); 

  const handleButtonClick = () => {
    navigate('/registrationform'); 
  };

  return (
    <div className='mainCont'>
        
        <Crau/>

      <div className='text'>
        <h1>चंद्रवंशी का इतिहास</h1>
        <p>चंद्रवंशी भारतीय पौराणिक ग्रंथों में वर्णित एक प्रमुख वंश है, जिसे चंद्रमा से उत्पन्न माना जाता है। यह वंश वेद, पुराण, और महाकाव्यों में विस्तृत रूप से वर्णित है और भारतीय इतिहास और संस्कृति में इसका महत्वपूर्ण स्थान है।</p>

        <h2>चंद्रवंशी की उत्पत्ति</h2>
        <p>चंद्रवंशी वंश का प्रारंभ चंद्रमा (सोम) से हुआ माना जाता है। चंद्रमा को देवता, ऋषि, और ब्रह्माण्डीय तत्व के रूप में पूजा जाता था। पुराणों के अनुसार, चंद्रमा के पुत्र बुद्ध थे, जो चंद्रवंशी वंश के प्रथम राजा बने।</p>

        <h2>प्रमुख राजा और उनकी भूमिका</h2>
        <p>चंद्रवंशी वंश में कई महान राजा हुए, जिनमें से कुछ का वर्णन निम्नलिखित है:</p>
        <ul>
          <li>बुद्ध: चंद्रमा के पुत्र और इस वंश के पहले राजा।</li>
          <li>पुरुरवा: बुद्ध के पुत्र, जो अप्सरा उर्वशी के साथ अपने प्रेम कथा के लिए प्रसिद्ध हैं।</li>
          <li>ययाति: एक अन्य प्रमुख चंद्रवंशी राजा, जिनके पांच पुत्रों ने विभिन्न राजवंशों की स्थापना की।</li>
          <li>पांडव और कौरव: महाभारत में वर्णित पांडव और कौरव भी इसी वंश के थे।</li>
        </ul>

        <h2>महत्वपूर्ण घटनाएँ और योगदान</h2>
        <ul>
          <li>महाभारत का युद्ध: चंद्रवंशी वंश के कौरव और पांडवों के बीच का युद्ध भारतीय इतिहास और संस्कृति में एक महत्वपूर्ण घटना है।</li>
          <li>रामायण और चंद्रवंशी कनेक्शन: रामायण में भी चंद्रवंशी वंश का परोक्ष रूप से उल्लेख मिलता है।</li>
          <li>राजनीतिक और सांस्कृतिक योगदान: इस वंश ने भारत के कई क्षेत्रों में अपनी उपस्थिति दर्ज कराई और कला, संस्कृति, और विज्ञान में योगदान दिया।</li>
        </ul>

        <h2>पुराणों में स्थान</h2>
        <p>वेदों और पुराणों में चंद्रवंशी वंश को सूर्यवंशी वंश के समकक्ष माना गया है। भागवत पुराण, विष्णु पुराण, और महाभारत में इस वंश का विस्तृत विवरण मिलता है।</p>

        <h2>आधुनिक परिप्रेक्ष्य</h2>
        <p>आज भी चंद्रवंशी वंशज विभिन्न समुदायों में पाए जाते हैं, जो अपनी परंपराओं और विरासत को संजोए हुए हैं। कई संगठन और संस्थाएँ चंद्रवंशी गौरव को पुनर्जीवित करने और उनके योगदान को संरक्षित करने का प्रयास कर रही हैं।</p>

        <button className='button' onClick={handleButtonClick}>चंद्रवंशी समाज से जुड़ने के लिए यहां क्लिक करें</button>
     
      </div>
    </div>
  );
};

export default Home;
